Public Member Functions | Friends | List of all members
ACAPI::MEP::TakeOffUIManager Class Referencefinal
MEP Element Manager
The TakeOffUIManager contains UI-related services for an TakeOff. More...
#include <MEPTakeOffUIManager.hpp>
 Inheritance diagram for ACAPI::MEP::TakeOffUIManager:
 Public Member Functions
Result< TakeOffDefault >  | CreateTakeOffDefaultFromToolUIData (const TBUI::IAPIToolUIData &toolUIData)
Creates a TakeOffDefault from a toolUIData.
Result< void >  | ApplyTakeOffDefaultToToolUIData (TBUI::IAPIToolUIData &toolUIData, const TakeOffDefault &TakeOffDefault)
Changes the default elem in the given toolUIData.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
Result< TakeOffUIManager >  | CreateTakeOffUIManager ()
Creates a TakeOffUIManager.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The TakeOffUIManager contains UI-related services for an TakeOff.
Since
Archicad 28
Member Function Documentation
◆ ApplyTakeOffDefaultToToolUIData()
 Result< void > ACAPI::MEP::TakeOffUIManager::ApplyTakeOffDefaultToToolUIData  |  ( |  TBUI::IAPIToolUIData & |  toolUIData,
|  const TakeOffDefault & |  TakeOffDefault )
Changes the default elem in the given toolUIData.
Parameters
toolUIData | The data in which the default elem will be changed
TakeOffDefault | The default to be set
Returns
Returns error if the TakeOffDefault is not the same type as the Default in IAPIToolUIData, or if they mismatch in their MEP Domain, otherwise nothing.
◆ CreateTakeOffDefaultFromToolUIData()
 Result< TakeOffDefault > ACAPI::MEP::TakeOffUIManager::CreateTakeOffDefaultFromToolUIData  |  ( |  const TBUI::IAPIToolUIData & |  toolUIData | )
Creates a TakeOffDefault from a toolUIData.
Parameters
toolUIData | The data which contains the temporary state of the TakeOff in the scope of a Settings Dialog.
Returns
Returns error if the given Default from the IAPIToolUIData is not an TakeOffDefault, otherwise returns the TakeOffDefault created from it.
Friends And Related Symbol Documentation
◆ CreateTakeOffUIManager
 Result< TakeOffUIManager > CreateTakeOffUIManager  |  ( |   | )
friend
Creates a TakeOffUIManager.
Returns
If able, creates a new manager for TakeOff, otherwise Error.